Public Member Functions | Static Public Member Functions | Public Attributes | List of all members
ACAPI::MEP::v1::Terminal Class Referencefinal
MEP Element Manager
The Terminal is a complex element with a single port. More...
#include <MEPTerminal.hpp>
 Inheritance diagram for ACAPI::MEP::v1::Terminal:
 Public Member Functions
~Terminal ()
TerminalDefault  | PickUpDefault () const
Picks up the Default from the Terminal.
Domain  | GetDomain () const
Returns the domain of the Terminal.
template<typename ModifierFunc >
Result< void >  | Modify (const ModifierFunc &modifierFunc, const GS::UniString &undoString)
Executes the passed modifier scope in an Undoable command.
Result< void >  | Inject (const TerminalDefault &terminalDefault)
Injects the Default settings into the Terminal.
 Public Member Functions inherited from ACAPI::MEP::v1::ModifiableElementBase
template<typename ModifierFunc >
Result< void >  | Modify (const ModifierFunc &modifierFunc, const GS::UniString &undoString)
Executes the passed modifier scope in an Undoable command.
~Modifier ()
void  | SetAnchorPoint (const API_Coord3D &anchorPoint)
Sets the anchor point of the ModifiableElement.
void  | SetOrientation (const MEP::Orientation &orientation)
Sets the orientation of the ModifiableElement.
void  | SetObjectId (const API_Guid &libraryPartId)
Sets the referenced library part of the ModifiableElement.
 Public Member Functions inherited from ACAPI::MEP::v1::ElementBase
bool  | Exists () const
std::vector< UniqueID >  | GetPortIDs () const
std::vector< UniqueID >  | GetDirectConnectedMEPElementIds () const
API_Coord3D  | GetAnchorPoint () const
Orientation  | GetOrientation () const
API_Guid  | GetObjectId () const
 Static Public Member Functions
static Result< Terminal >  | Get (const UniqueID &uniqueId)
Returns a Terminal.
 Public Attributes
friend  | Terminal
 Public Attributes inherited from ACAPI::MEP::v1::ModifiableElementBase
friend  | ModifiableElementBase
 Additional Inherited Members
 Protected Member Functions inherited from ACAPI::MEP::v1::ModifiableElementBase
ModifiableElementBase (std::shared_ptr< Impl::IElementBaseImpl >)
~ModifiableElementBase ()
Modifier (ModifiableElementBase &)
void  | FinalizeModification () override
 Protected Member Functions inherited from ACAPI::MEP::v1::ElementBase
ElementBase (std::shared_ptr< Impl::IElementBaseImpl >)
~ElementBase ()
Detailed Description
The Terminal is a complex element with a single port.
Since
Archicad 27
Constructor & Destructor Documentation
◆ ~Terminal()
 ACAPI::MEP::v1::Terminal::~Terminal  |  ( |   | )
Member Function Documentation
◆ Get()
 static Result< Terminal > ACAPI::MEP::v1::Terminal::Get  |  ( |  const UniqueID &  |  uniqueId | )
static
Returns a Terminal.
Parameters
uniqueId | The UniqueID of the requested Terminal.
Returns
If the uniqueId belongs to a Terminal, returns the object associated to it, otherwise Error.
◆ GetDomain()
 Domain ACAPI::MEP::v1::Terminal::GetDomain  |  ( |   | ) |   const
Returns the domain of the Terminal.
Returns
The returned domain can be ventilation or piping.
◆ Inject()
 Result< void > ACAPI::MEP::v1::Terminal::Inject  |  ( |  const TerminalDefault &  |  terminalDefault | )
Injects the Default settings into the Terminal.
Parameters
terminalDefault | The Default what will be injected. One should pay attention to the parameter, it has to belong to the same domain than the object it is called for.
Returns
Returns an error if the injection fails for some reason, otherwise nothing.
◆ Modify()
 template<typename ModifierFunc >
 Result< void > ACAPI::MEP::v1::Terminal::Modify  |  ( |  const ModifierFunc &  |  modifierFunc,
|  const GS::UniString &  |  undoString
)
Executes the passed modifier scope in an Undoable command.
Parameters
modifierFunc | The modifier scope (lambda, std::function or function pointer) the caller wants to execute.
undoString | The text which appears in the undo queue of Archicad after executing the command.
Returns
Returns an error if the process of modification fails for some reason, otherwise nothing.
◆ PickUpDefault()
 TerminalDefault ACAPI::MEP::v1::Terminal::PickUpDefault  |  ( |   | ) |   const
Picks up the Default from the Terminal.
Returns
Returns a TerminalDefault with the parameters of the object it was called for.
Member Data Documentation
◆ Terminal
 friend ACAPI::MEP::v1::Terminal::Terminal